# Transformar un dataframe en una base de datos relacional

In [30]:
import pandas as pd 
data = [(1,'Joan','Gasull', 25, 1, 'Libreta',   1.2,   .4, 0.8,   3, '03-02-2018'),
        (1,'Joan','Gasull', 25, 2, 'Bolígrafo', 0.4, 0.15, 0.25,  1, '03-02-2018'),
        (1,'Joan','Gasull', 25, 1, 'Libreta',   1.2,   .4,  0.8,  3, '15-02-2018'),
        (2,'Joan','López',  33, 2, 'Bolígrafo', 0.4, 0.15, 0.25,  4, '01-02-2018'),
        (2,'Joan','López',  33, 1, 'Libréta',   1.2,   .4,  0.8, 10, '05-03-2018'),
        (3,'Maria','García',40, 1, 'Libréta',   1.2,   .4,  0.8, 10, '09-02-2018')]

labels = ['Comprador_id','Nombre','Apellido','Edad','Producto_id','Producto','Precio','Coste','Margen','Cantidad','Fecha']

### Transformar a un DataFrame

In [31]:
df = pd.DataFrame.from_records(data, columns = labels)

In [32]:
df # Se muestra que hay variables  repetidas como nombre y apellido, tampoco la edad, coste, margenes

,Comprador_id,Nombre,Apellido,Edad,Producto_id,Producto,Precio,Coste,Margen,Cantidad,Fecha
0,1,Joan,Gasull,25,1,Libreta,1.2,0.40,0.80,3,03-02-2018
1,1,Joan,Gasull,25,2,Bolígrafo,0.4,0.15,0.25,1,03-02-2018
2,1,Joan,Gasull,25,1,Libreta,1.2,0.40,0.80,3,15-02-2018
3,2,Joan,López,33,2,Bolígrafo,0.4,0.15,0.25,4,01-02-2018
4,2,Joan,López,33,1,Libréta,1.2,0.40,0.80,10,05-03-2018
5,3,Maria,García,40,1,Libréta,1.2,0.40,0.80,10,09-02-2018

### Partir tabla en tres subtablas más pequeñas que contengan sólo información necesaria

In [33]:
# DataFrame con una sola fila para cada comprador

compradores = df.drop_duplicates(subset = 'Comprador_id', keep = 'first')
compradores

,Comprador_id,Nombre,Apellido,Edad,Producto_id,Producto,Precio,Coste,Margen,Cantidad,Fecha
0,1,Joan,Gasull,25,1,Libreta,1.2,0.40,0.80,3,03-02-2018
3,2,Joan,López,33,2,Bolígrafo,0.4,0.15,0.25,4,01-02-2018
5,3,Maria,García,40,1,Libréta,1.2,0.40,0.80,10,09-02-2018

### Crear tabla de clientes

In [34]:
# Eliminar las columnas que no necesitemos en la tabla de compradores
compradores = compradores[['Comprador_id','Nombre','Apellido','Edad']]#,"Apellido","Edad"]] # Se seleccionan las columnas que se desean guardar
compradores

   Comprador_id Nombre Apellido  Edad
0             1   Joan   Gasull    25
3             2   Joan    López    33
5             3  Maria   García    40

### Crear tabla de productos

In [35]:
productos = df.drop_duplicates(subset="Producto_id",keep="first")
productos

,Comprador_id,Nombre,Apellido,Edad,Producto_id,Producto,Precio,Coste,Margen,Cantidad,Fecha
0,1,Joan,Gasull,25,1,Libreta,1.2,0.40,0.80,3,03-02-2018
1,1,Joan,Gasull,25,2,Bolígrafo,0.4,0.15,0.25,1,03-02-2018

In [37]:
# Quedarse con las columnas necesarias
productos = productos[['Producto_id','Producto','Precio','Coste','Margen']]
productos

   Producto_id   Producto  Precio  Coste  Margen
0            1    Libreta     1.2   0.40    0.80
1            2  Bolígrafo     0.4   0.15    0.25

### Crear tabla de compras

In [38]:
# Debido a que el DataFrame original respondia a las compras realizadas se realiza lo siguiente
compras = df[['Comprador_id','Producto_id','Fecha','Cantidad']]
compras # Informacion que une la tabla de compradores con la tabla de productos

   Comprador_id  Producto_id       Fecha  Cantidad
0             1            1  03-02-2018         3
1             1            2  03-02-2018         1
2             1            1  15-02-2018         3
3             2            2  01-02-2018         4
4             2            1  05-03-2018        10
5             3            1  09-02-2018        10